БСХП_копия_фреша.РасширениеЕАС/src/ExchangePlans/ОбменЕАСБухгалтерия/ОбменЕАСБухгалтерия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="986878db-e72f-46a3-a93c-44a59f3a54b4">
  <name>ОбменЕАСБухгалтерия</name>
  <attributes>
    <name>ОбластьДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТестоваяИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьДанныхКорреспондента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКорреспондента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

БСХП_копия_фреша.РасширениеЕАС/src/ExchangePlans/ОбменЕАСБухгалтерия/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ЭтотУзел Тогда
		Элементы.Организации.Видимость 						= Ложь;
		Элементы.ИспользоватьОтборПоОрганизациям.Видимость 	= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоОрганизациямПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()      
	Элементы.Организации.Видимость = Не Объект.ЭтотУзел И Объект.ИспользоватьОтборПоОрганизациям;
	Элементы.ГруппаКорреспондент.Видимость = Не Объект.ЭтотУзел;
	Элементы.ОбластьДанных.Видимость       = Не Объект.ЭтотУзел;
КонецПроцедуры	


#КонецОбласти
